//=============================================================
// for each node/relation find all strees/housenumbers
db.createCollection("streets")

db.nodes.find({$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ] })
db.relations.find({$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ] })

map = function() {
	if(this.tags["addr:street"] != undefined){
		var nums = new Array();
		if(this.tags["addr:housenumber"] != undefined){
			nums.push(this.tags["addr:housenumber"]);
		}
		emit(this.tags["addr:street"], {street: this.tags["addr:street"], numbers: nums});
	}
}

reduce = function(key, values) {
	var result = {street: key, numbers: []};
	var nums = new Array();
    values.forEach(function(value) {
		value.numbers.forEach(function(v) {
			nums.push(v)
		});	  
    });
	result.numbers = nums;
    return result;
}

// nodes
db.runCommand(
 { mapreduce : "nodes"
   , map : map
   , reduce : reduce
   , query: {$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ]}
   , out: {merge : "streets"} 
   , verbose : true
 }
);

// relations
db.runCommand(
 { mapreduce : "relations"
   , map : map
   , reduce : reduce
   , query: {$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ]}
   , out: {merge : "streets"} 
   , verbose : true
 }
);

db.streets.find()

// all streets:
Streets: [Äàðíèöêèé Áóëüâàð, Ðà¿ñè Îê³ïíî¿ âóëèöÿ, Êàóíàñüêà âóëèöÿ, Òàòàðñüêà, Áîæåíêà âóëèöÿ, Äíåïðîäçåðæèíñêàÿ óë., ñ, Rusanivska Nabirezhna, Ëåí³íà âóëèöÿ, Ãðèøêî, Åíåðãåòèê³â âóëèöÿ, Áðàòèñëàâñüêà âóëèöÿ, Âàñèëÿ Ïîðèêà âóëèöÿ, Ñàãàéäà÷íîãî Ïåòðà, Óðèöüêîãî, Ñ³÷îâèõ Ñòð³ëüö³â âóëèöÿ, Îáîëîíñêàÿ Íàáåðåæíàÿ, óë. Àâèàêîíñòðóêòîðà Àíòîíîâà, Ïðàçüêà âóëèöÿ, Àêàäåì³êà Ñòðàæåñêî âóëèöÿ, Çäîëáóíîâñêàÿ, Äðóæêîâñüêà âóëèöÿ, Ìîñêîâñüêèé ïðîñïåêò, Ìåõàí³çàòîð³â âóëèöÿ, Îíîðå äå Áàëüçàêà âóëèöÿ, Áîãäàíà Õìåëüíèöüêîãî âóëèöÿ, Áîðè÷³â óçâ³ç, Âîçç'ºäíàííÿ ïðîñïåêò, Ãëèáî÷èöüêà âóëèöÿ, Ãåíåðàëà Âàòóòiíà ïðîñïåêò, Ìèëü÷àêîâà âóë., Êîñòÿíòèíiâñüêà âóëèöÿ, Òè÷èíè Ïàâëà ïðîñïåêò, Ñàãàéäà÷íîãî, Ñòðàòåã³÷íå øîñå, Iãîðiâñüêà, Áðàòèñëàâñêàÿ, Ñèìèðåíêà âóëèöÿ, Ìîñêîâñêèé ïðîñïåêò, Oleny Pchilky, Âàñèëÿ Êó÷åðà âóëèöÿ, Áàéêîâà âóëèöÿ, Òóëóçè âóëèöÿ, Õîðèâà, Áàêèíñüêà âóëèöÿ, Àâèàêîíñòðóêòîðà Àíòîíîâà, Óøèíñüêîãî âóëèöÿ, Êíÿæèé Çàòîí âóëèöÿ, Ï³òåðñüêà âóëèöÿ, Íîâîäàðíèöüêà âóëèöÿ, Âèáîðçüêà âóëèöÿ, Âåëèêà Âàñèëüê³âñüêà âóëèöÿ, Âàñèëüê³âñüêà âóëèöÿ, Îíîðå äå Áàëüçàêà, ²âàíà Êëèìåíêà âóëèöÿ, Ìàðòèðîñÿíà âóëèöÿ, Âèøãîðîäñüêà, Íàáåðåæíî-Õðåùàòèöüêà, Ïàâë³âñüêà, Ëåñ³ Óêðà¿íêè áóëüâàð, Äðàãîìàíîâà, Âåðõîâèííà âóëèöÿ, Íàáåðåæíî-Êîð÷óâàòñüêà âóëèöÿ, Ìèê³ëüñüêî-Áîòàí³÷íà âóëèöÿ, ×åðâîíîçîðÿíèé ïðîñïåêò, Äîíåöüêà âóëèöÿ, Ñóëåéìàíà Ñòàëüñêîãî, Áåðåçíÿêîâñêàÿ, Òóðãåí³âñüêà, Áîðèñï³ëüñüêà, Ìèõàéë³âñüêà âóëèöÿ, âóë. Ãóñîâñüêîãî, Ñóëåéìàíà Ñòàëüñüêîãî âóëèöÿ, Ï³âí³÷íà âóëèöÿ, Khoryva, Ãåðî¿â Îáîðîíè âóëèöÿ, Ìàðèíè Öâºòàºâî¿, ×åðâîíîòêàöüêà âóëèöÿ, Áåðåçíåâà âóëèöÿ, Îëåñÿ Ãîí÷àðà âóëèöÿ, Ãðèãîðîâè÷à Áàðñüêîãî âóëèöÿ, Ïî÷àéíèíñüêà, Ãîñï³òàëüíà âóëèöÿ, Æèëÿíñüêà âóëèöÿ, Ìåæèãiðñüêà, Ñåìüè-Ñîñíèíûõ, Æîëóäºâà âóëèöÿ, ×óìàêà Âàñèëÿ âóëèöÿ, Konstyantynivska str., Òðîñòÿíåöêàÿ óë., Ìàðèíè Öâºòàºâî¿ âóëèöÿ, Âàñèëÿ Êàñ³ÿíà âóëèöÿ, Áóëãàêîâà âóëèöÿ, Ìàðøàëà Òèìîøåíêî âóëèöÿ, ªðåâàíñüêà âóëèöÿ, Þð³ÿ Êîöþáèíñüêîãî âóëèöÿ, Ìèíñêîå øîññå, Âåðõíÿÿ óëèöà, Ãîãîë³âñüêà âóëèöÿ, Ëàðèñè Ðóäåíêî âóëèöÿ, Ðîñ³éñüêà âóëèöÿ, Ìåäîâà, Ãîãîëåâñêàÿ, Ìèêîëè Êðàâ÷åíêà âóëèöÿ, Âîëîäèìèðñüêà âóëèöÿ, ßðîñëàâ³â Âàë âóëèöÿ, ²ñêð³âñüêà âóëèöÿ, ×åðíîìîðñêàÿ óëèöà, Ëàáîðàòîðíèé ïðîâóëîê, Ðåâóöüêîãî âóëèöÿ, Ïðèòèññêî-Íèêîëüñêàÿ óëèöà, Chervonoarmiyska, Òèìîô³ÿ Øàìðèëà âóëèöÿ, Ïàíüê³âñüêà âóë., Âîëîñüêà, Ôëîðåíö³¿ âóëèöÿ, Òåëiãè Îëåíè âóëèöÿ, Íàóêè ïðîñïåêò, Ïåðñïåêòèâíà âóëèöÿ, Êîì³ñàðà Ðèêîâà âóëèöÿ, Æìà÷åíêà Ãåíåðàëà, Ãíàòà Þðè âóëèöÿ, Ñ³ì'¿ Ñîñí³íèõ âóëèöÿ, Òåîäîðà Äðàéçåðà âóëèöÿ, Ìàê³¿âñüêà, Ëüâà Òîëñòîãî, Ãðèãîðiÿ Ñêîâîðîäè, Âåðõí³é Âàë âóëèöÿ, Àäàìà Ì³öêåâè÷à âóëèöÿ, Ë³õà÷îâà áóëüâàð, Ìèõà¿ëà Äîíöÿ âóëèöÿ, Òåðåìê³âñüêà âóëèöÿ, Ìàêñèìà Êðèâîíîñà âóëèöÿ, Âîëãîãðàäñüêà, Ñîô³¿ Ïåðîâñüêî¿ âóëèöÿ, Áàæîâà âóëèöÿ, Çîä÷èõ âóëèöÿ, Àíäð³¿âñüêèé óçâ³ç, ×îðíîáèëüñüêà âóëèöÿ, Ì³í³íà âóëèöÿ, Obolonsky ave, Îáîëîíñüêèé ïðîñïåêò, ×åðâîíîàðì³éñüêà âóëèöÿ, ßðîñëàâñêàÿ, Áîðèñîãë³áñüêà, Øîòà Ðóñòàâåë³ âóëèöÿ, Ñåðàôèìîâè÷à âóëèöÿ, Âîëîñüêà âóëèöÿ, Áóä³âåëüíèê³â âóëèöÿ, 156/2, Áîðùàã³âñüêà âóëèöÿ, Ñåâàñòîïîëüñüêà ïëîùà, Êîñòÿíòèíiâñüêà, Ïàòð³ñà Ëóìóìáè âóëèöÿ, Áó÷ìè Àìâðîñ³ÿ âóëèöÿ, Ìèê³ëüñüêî-Ñëîá³äñüêà âóëèöÿ, Àêàäåì³êà Êîðîëüîâà ïðîñïåêò, Áó÷ìû Àìâðîñèÿ, Ìàëà Æèòîìèðñüêà âóëèöÿ, Ìåæîâà âóëèöÿ, Ïðèìàêîâà âóëèöÿ, Ô³çêóëüòóðè âóëèöÿ, Ìèðó ïðîñïåêò, Áàñåéíà âóëèöÿ, Ñîö³àë³ñòè÷íà âóëèöÿ, Ãåðîåâ Ñòàëèíãðàäà, Ðóñàí³âñüêèé áóëüâàð, Âîëèíñüêà âóëèöÿ, Ïðîð³çíà âóëèöÿ, Ñð³áíîê³ëüñüêà âóëèöÿ, Õìåëüíèöüêà âóëèöÿ, Òóðãåí³âñüêà âóë., Ëàéîøà Ãàâðî âóëèöÿ, Áàããîâóò³âñüêà, Äîáðèé Øëÿõ âóëèöÿ, ×îðîíîâîëà âóë., Êîëüöîâà áóëüâàð, Íîâîïèðîã³âñüêà âóëèöÿ, Âåðõîâèííà, Áðàòèñëàâñüêà âóë., Ëåîíòîâè÷à âóëèöÿ, Åíòóç³àñò³â âóëèöÿ, Õîðåâèé ïðîâóëîê, Çàáîëîòíîãî ïðîñïåêò, ²ëë³÷à âóëèöÿ, Ìàçåïè ²âàíà âóëèöÿ, Áðóñèëîâñüêà âóëèöÿ, Ïàíàñà Ìèðíîãî, Ëàáîðàòîðíà âóëèöÿ, Ïî÷àéíèíñüêà âóëèöÿ, Øîòà Ðóñòàâåëè, Ëåéïöèçüêà âóëèöÿ, Àêàäåì³êà ßíãåëÿ âóëèöÿ, Ñàêñàãàíñüêîãî âóëèöÿ, ×åðâîíîï³ëüñüêà âóëèöÿ, Âîëîäèìèðà Ìàÿêîâüñêîãî ïðîñïåêò, Íàóêè ïðîñï., Ìàðøàëà Æóêîâà âóëèöÿ, Êðóãëîóí³âåðñèòåòñüêà âóëèöÿ, Ñàëþòíà âóëèöÿ, Âåëèêà Æèòîìèðñüêà, Ì³øóãè, Õàðê³âñüêå Øîñå âóëèöÿ, Êîìáàéíåð³â âóëèöÿ, Ðåâóöêîãî, Ìàòå-Çàëêè, Ì.Ãðóøåâñüêîãî âóë., Ìàðøàëà Ìàëèíîâñüêîãî âóëèöÿ, ßðîñëàâà Ãàøåêà áóëüâàð, Ðàéäóæíà âóëèöÿ, Ëåáåäºâà-Êóìà÷à âóëèöÿ, Êîìàíäàðìà Óáîðåâè÷à âóëèöÿ, Ìåæîâèé ïðîâóëîê, Ëåïñå ²âàíà áóëüâàð, Òåðåìêîâñüêà âóëèöÿ, Ïå÷åí³çüêà, Íèêîëàÿ Ìàòåþêà óëèöà, Ìåõàí³çàòîð³â, Òû÷èíû Ïàâëà ïðîñïåêò, Ëåñÿ Êóðáàñà ïðîñïåêò, Çëàòîóñò³âñüêà âóëèöÿ, Ñèìîíà Ïåòëþðè âóëèöÿ, Âåëèêà Îêðóæíà âóëèöÿ, Ïîëêîâíèêà Ïîòºõ³íà âóëèöÿ, Ïðèëóæíà âóëèöÿ, Îëåêñ³¿âñüêà âóëèöÿ, Êðàñíîàðìåéñêàÿ, Òåðåùåíê³âñüêà âóëèöÿ, Áîãàòèðñüêà âóëèöÿ, Íåêðàñîâñêàÿ óëèöà, Ðèáàëüñüêà âóëèöÿ, Òðîñòÿíåöüêà âóëèöÿ, Ïîëêîâíèêà Çàòåâàõ³íà âóëèöÿ, Ì³ëþòåíêà, Âåðáèöüêîãî àðõ³òåêòîðà âóëèöÿ, Ëüâà Òîëñòîãî âóëèöÿ, Ëºñêîâà, Êîñòÿíòèí³âñüêà âóëèöÿ, Ñàïåðíå Ïîëå âóëèöÿ, Ìèøóãè Îëåêñàíäðà âóë., Òåñëÿðñüêà, Ïîâ³òðîôëîòñüêèé ïðîñïåêò, ×àäàºâà Ïåòðà âóëèöÿ, Óðë³âñüêà âóëèöÿ, óë. ×åðíîáûëüñêàÿ, Êîíòðàêòîâà ïëîùà, Áàññåéíàÿ, Øóìñêîãî Þðèÿ, Ìàðøàëà ßêóáîâñüêîãî âóëèöÿ, Äàâûäîâà Àëåêñåÿ áóëüâàð, Ê³êâ³äçå âóëèöÿ, Âîðîâñüêîãî âóëèöÿ, Äðóæáè Íàðîä³â áóëüâàð, Ãëóøêîâà ïðîñïåêò, Áðàòñüêà, Íàðîäíîãî Îïîë÷åííÿ âóëèöÿ, Ôðîëîâñüêà âóëèöÿ, Ìèêîëè Ïèìîíåíêà âóëèöÿ, Äìèòð³âñüêà âóëèöÿ, Íàáåðåæíî-Êîð÷óâàòñüêà âóë., Àêàäåì³êà Êàáëóêîâà âóëèöÿ, Ãåíåðàëà Íàóìîâà âóëèöÿ, Ë³ñîâèé ïðîñïåêò, Ãåðî¿â Äí³ïðà âóëèöÿ, ïð. Ãðèãîðåíêà, Æìåðèíñüêà âóëèöÿ, Áîðè÷iâ Òiê, Ìîñêîâñüêà âóëèöÿ, Âîëîäèìèðà Ìàÿêîâñüêîãî ïðîñïåêò, Ñ³÷îâèõ Ñòð³ëüö³â âóë., Ìàðèíè Ðàñêîâî¿ âóëèöÿ, ×îðíîâîëà âóëèöÿ, Ëóíà÷àðñüêîãî âóëèöÿ, Òåîäîðà Äðàéçåðà, Çî¿ Ãàéäàé âóëèöÿ, Ðóñàí³âñüêà íàáåðåæíà, Ëîìîíîñîâà âóëèöÿ, Áåðåçíÿê³âñêà âóëèöÿ, Ãåòüìàíà Âàäèìà âóëèöÿ, Ìèêîëè Áàæàíà ïðîñïåêò, Áåðåçíÿê³âñüêà âóëèöÿ, Êîòåëüíèêîâà, Ãåòüìàíà Âàäèìà âóëèöÿ (r_street), Ñòîëè÷íå øîñå, Ñïàñüêà, Àêàäåì³êà Êîðîëüîâà âóëèöÿ, Ãðèãîðåíêî Ïåòðà ïðîñïåêò, Ðåâóöêîãî âóëèöÿ, Êîòîâñüêîãî, Ïîêðîâñüêà, Äîêó÷àºâñüêèé ïðîâ., Âåíåö³ÿ ïëÿæ, Øîëóäåíêà, Ãåîðã³ÿ Ãîíãàäçå ïðîñïåêò, Ïåòðîâñüêîãî âóëèöÿ, Õîðèâà âóëèöÿ, Òåëèãè Îëåíè, Õðåùàòèê âóëèöÿ, Ôðîëîâñüêà, Äí³ïðîâñüêà íàáåðåæíà, Ïóøê³íñüêà âóëèöÿ, Ñìîëåíñüêà âóëèöÿ, ²âàøêåâè÷à ßðîñëàâà, Äðàãîìàíîâà âóëèöÿ, Äåãòÿð³âñüêà, Ìàðøàëà Òèìîøåíêî, Àêàäåì³êà Ô³ëàòîâà âóëèöÿ, Ãåòüìàíà Âàäèìà âóëèöÿ (s_street), Êèïð³àíîâà Àêàäåì³êà âóëèöÿ, Çàñëîíîâà Êîñòÿíòèíà âóëèöÿ, Íåâñüêà âóëèöÿ, Ïðåäñëàâèíñüêà âóëèöÿ, Ïå÷åðñüêèé óçâ³ç, Âåðõíié Âàë, Æóêîâà, Íàáåðåæíî-Õðåùàòèöüêà âóëèöÿ, Ä³ëîâà (Äèìèòðîâà) âóëèöÿ, Ùîðñà âóëèöÿ, Ñâ³òëèöüêîãî âóëèöÿ, Âåëèêà Æèòîìèðñüêà âóëèöÿ, Àâòîçàâîäñüêà âóëèöÿ, Íåìèðîâè÷à-Äàí÷åíêà âóëèöÿ, Àêàäåì³êà Á³ëåöüêîãî âóëèöÿ, Ãåðî¿â Ñòàë³íãðàäó ïðîñïåêò, Ãåíåðàëà Ïîòàïîâà âóëèöÿ, Ëÿòîøèíñüêîãî âóëèöÿ, Þð³ÿ Ãàãàð³íà ïðîñïåêò, Ëîáà÷åâñüêîãî ïðîâ., Âëàäèìèðà Ìàÿêîâñêîãî ïðîñïåêò, Ñâîáîäè ïðîñïåêò, Êóòóçîâà âóëèöÿ, Îëåêñàíäðà Ïèðîãîâñüêîãî âóëèöÿ, Îëåêñàíäðà Áëîêà âóëèöÿ, Äìèòð³âñüêà, Ïàâë³âñüêà âóëèöÿ, ßëòèíñüêà âóëèöÿ, Ðå÷íàÿ óëèöà, Äîâíàð-Çàïîëüñüêîãî, Àíòîíîâè÷à âóëèöÿ, Àíäð³ÿ Ìàëèøêà, Ìå÷í³êîâà âóë., Àíòîíîâè÷à, Ìèøóãè Îëåêñàíäðà âóëèöÿ, Ëóíà÷àðñêîãî, Ãåðî¿â Êîñìîñó âóëèöÿ, ×óäíîâñüêîãî âóëèöÿ, Ìèðîï³ëüñüêà âóëèöÿ, Ëàáîðàòîðíà, Òàìïåðå âóë., Âîðîâñüêîãî âóë., Ìå÷íèêîâà, Ïåðåìîãè ïðîñïåêò, ×îêîë³âñüêèé áóëüâàð, Ïîæàðñüêîãî âóëèöÿ, Äàâèäîâà Îëåêñ³ÿ áóëüâàð, Âûøãîðîäñêàÿ, âóë. Ëºñêîâà, Yaroslaviv Val, Àðòåìà, Îëåñÿ Ãîí÷àðà, Ùåêàâèöüêà âóëèöÿ, Ìåëüíèêîâà, Ñàðàòîâñüêà âóëèöÿ, Ñ³ìôåðîïîëüñüêà âóëèöÿ, Ùîðñà ïðîâóëîê, Êîöþáèíñüêîãî Ìèõàéëà âóëèöÿ, Ñîëîì’ÿíñüêà âóëèöÿ, Ï÷åëêè, Àâòîçàâîäñüêà, Â³äðàäíèé ïðîñïåêò, Ìèêîëè Ãð³í÷åíêà âóëèöÿ, Îòòî Øì³äòà, Çäîëáóí³âñüêà âóëèöÿ, Ââåäåíñüêà âóëèöÿ, ²âàíà Ôðàíêà âóëèöÿ, Ïðàö³ áóëüâàð, Ëåñêîâà, ßðîñëàâñüêà âóëèöÿ, Ãðèãîðîâè÷à-Áàðñêîãî, Ïðàâäè ïðîñïåêò, Ìå÷í³êîâà âóëèöÿ, Âîðîâñêîãî, Ïåòðà Âåðøèãîðè âóëèöÿ, Ãîðë³âñüêà âóëèöÿ, Ìèêîëè Çàêðåâñüêîãî âóëèöÿ, Ìèõàéëà Ãðóøåâñüêîãî âóëèöÿ, Ñåðàôèìîâè÷à, Óìàíñüêà âóëèöÿ, Ðîcñèéñêàÿ óë., Ðîìåíà Ðîëëàíà áóëüâàð, Ïåòðà Çàïîðîæöÿ âóëèöÿ, Ìàðøàëà Òèìîøåíêà âóëèöÿ, Àííè Àõìàòîâî¿ âóëèöÿ, Ñîëîìåíñêàÿ, Àêàäåì³êà Ãëóøêîâà ïðîñïåêò, Ïîë³ñüêèé ïðîâóëîê, Øóìñüêîãî Þð³ÿ âóëèöÿ, ²âàíà Ôåäîðîâà âóëèöÿ, Ëàãåðíàÿ óë., Òèìîô³ÿ Øàìðèëî, ²âàíà Êóäð³ âóëèöÿ, Àêàäåì³êà Êîñòè÷åâà âóëèöÿ, Ìåòðîáóä³âñüêà âóëèöÿ, Ïåòðà Ãðèãîðåíêî ïðîñïåêò, Ìàðêà Âîâ÷êà âóëèöÿ, Óðèöüêîãî âóëèöÿ, Ïîë³òåõí³÷íà âóëèöÿ, Âîëãîãðàäñüêà âóëèöÿ, Ñº÷åíîâà âóëèöÿ, Äåêàáðèñò³â, Áîðèñà Ãìèð³ âóëèöÿ, Âåðõîâíî¿ Ðàäè áóëüâàð, Ë³ñê³âñüêà âóëèöÿ, Äàíüêåâè÷à, 21a, Ñîðòóâàëüíà, Í³æèíñüêà âóëèöÿ, ²ëë³íñüêà, Àâ³àêîíñòðóêòîðà Àíòîíîâà âóëèöÿ, Ñèìèðåíêî, Êîëüöåâàÿ äîðîãà, Øåëêîâè÷íàÿ óë, Êðàñíîçâåçäíûé, Áåðêîâåöüêà âóëèöÿ, Àíòîíîâè÷à (Ãîðüêîãî) âóëèöÿ, Ãîðüêîãî âóëèöÿ, ²âàíà Ëåïñå áóëüâàð, Äåãòÿð³âñüêà âóëèöÿ, Ãàéäàé Çî¿ âóëèöÿ, âóë. Àðñåíàëüíà, Ñîðòèðîâî÷íàÿ, Ëèòâèíåíêî-Âîëüãåìóò âóëèöÿ, Revutskogo, Óðîæàéíà âóëèöÿ, Àðñåíàëüíà âóëèöÿ, 40-ð³÷÷ÿ Æîâòíÿ ïðîñïåêò, Ãîëîñ³¿âñüêà âóëèöÿ, Ìåòàë³ñò³â âóëèöÿ, Ãîãîë³âñüêà, Ïîë³ñüêà âóëèöÿ, Òàðàñ³âñüêà âóëèöÿ, ßêóáà Êîëàñà âóëèöÿ, Àíäð³¿âñüêà, Ïàíüê³âñüêà âóëèöÿ, Äóáðîâèöüêà, Ïå÷åðñüêà ïëîùà, ×àïàºâà âóëèöÿ, Ìèõàéëà Ãðèøêà âóëèöÿ, Ïðîôåñîðà Ï³äâèñîöüêîãî âóëèöÿ, Êóðåí³âñüêà, Áîæåíêî âóëèöÿ, Ãåðî¿â Ñåâàñòîïîëÿ âóëèöÿ, Ïðèòèñêî-Íèêîëüñêàÿ, Áîæåíêî]
