//=============================================================
// for each node/relation find all strees/housenumbers
db.createCollection("streets")

db.nodes.find({$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ] })
db.relations.find({$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ] })

map = function() {
	if(this.tags["addr:street"] != undefined){
		var nums = new Array();
		if(this.tags["addr:housenumber"] != undefined){
			nums.push(this.tags["addr:housenumber"]);
		}
		emit(this.tags["addr:street"], {street: this.tags["addr:street"], numbers: nums});
	}
}

reduce = function(key, values) {
	var result = {street: key, numbers: []};
	var nums = new Array();
    values.forEach(function(value) {
		value.numbers.forEach(function(v) {
			nums.push(v)
		});	  
    });
	result.numbers = nums;
    return result;
}

// nodes
db.runCommand(
 { mapreduce : "nodes"
   , map : map
   , reduce : reduce
   , query: {$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ]}
   , out: {merge : "streets"} 
   , verbose : true
 }
);

// relations
db.runCommand(
 { mapreduce : "relations"
   , map : map
   , reduce : reduce
   , query: {$or : [ {"tags.addr:street" :  {$exists : true}}, {"tags.addr:housenumber" :  {$exists : true}} ]}
   , out: {merge : "streets"} 
   , verbose : true
 }
);

db.streets.find()

// all streets:
Streets: [Дарницкий Бульвар, Раїси Окіпної вулиця, Каунаська вулиця, Татарська, Боженка вулиця, Днепродзержинская ул., с, Rusanivska Nabirezhna, Леніна вулиця, Гришко, Енергетиків вулиця, Братиславська вулиця, Василя Порика вулиця, Сагайдачного Петра, Урицького, Січових Стрільців вулиця, Оболонская Набережная, ул. Авиаконструктора Антонова, Празька вулиця, Академіка Стражеско вулиця, Здолбуновская, Дружковська вулиця, Московський проспект, Механізаторів вулиця, Оноре де Бальзака вулиця, Богдана Хмельницького вулиця, Боричів узвіз, Возз'єднання проспект, Глибочицька вулиця, Генерала Ватутiна проспект, Мильчакова вул., Костянтинiвська вулиця, Тичини Павла проспект, Сагайдачного, Стратегічне шосе, Iгорiвська, Братиславская, Симиренка вулиця, Московский проспект, Oleny Pchilky, Василя Кучера вулиця, Байкова вулиця, Тулузи вулиця, Хорива, Бакинська вулиця, Авиаконструктора Антонова, Ушинського вулиця, Княжий Затон вулиця, Пітерська вулиця, Новодарницька вулиця, Виборзька вулиця, Велика Васильківська вулиця, Васильківська вулиця, Оноре де Бальзака, Івана Клименка вулиця, Мартиросяна вулиця, Вишгородська, Набережно-Хрещатицька, Павлівська, Лесі Українки бульвар, Драгоманова, Верховинна вулиця, Набережно-Корчуватська вулиця, Микільсько-Ботанічна вулиця, Червонозоряний проспект, Донецька вулиця, Сулеймана Стальского, Березняковская, Тургенівська, Бориспільська, Михайлівська вулиця, вул. Гусовського, Сулеймана Стальського вулиця, Північна вулиця, Khoryva, Героїв Оборони вулиця, Марини Цвєтаєвої, Червоноткацька вулиця, Березнева вулиця, Олеся Гончара вулиця, Григоровича Барського вулиця, Почайнинська, Госпітальна вулиця, Жилянська вулиця, Межигiрська, Семьи-Сосниных, Жолудєва вулиця, Чумака Василя вулиця, Konstyantynivska str., Тростянецкая ул., Марини Цвєтаєвої вулиця, Василя Касіяна вулиця, Булгакова вулиця, Маршала Тимошенко вулиця, Єреванська вулиця, Юрія Коцюбинського вулиця, Минское шоссе, Верхняя улица, Гоголівська вулиця, Лариси Руденко вулиця, Російська вулиця, Медова, Гоголевская, Миколи Кравченка вулиця, Володимирська вулиця, Ярославів Вал вулиця, Іскрівська вулиця, Черноморская улица, Лабораторний провулок, Ревуцького вулиця, Притисско-Никольская улица, Chervonoarmiyska, Тимофія Шамрила вулиця, Паньківська вул., Волоська, Флоренції вулиця, Телiги Олени вулиця, Науки проспект, Перспективна вулиця, Комісара Рикова вулиця, Жмаченка Генерала, Гната Юри вулиця, Сім'ї Сосніних вулиця, Теодора Драйзера вулиця, Макіївська, Льва Толстого, Григорiя Сковороди, Верхній Вал вулиця, Адама Міцкевича вулиця, Ліхачова бульвар, Михаїла Донця вулиця, Теремківська вулиця, Максима Кривоноса вулиця, Волгоградська, Софії Перовської вулиця, Бажова вулиця, Зодчих вулиця, Андріївський узвіз, Чорнобильська вулиця, Мініна вулиця, Obolonsky ave, Оболонський проспект, Червоноармійська вулиця, Ярославская, Борисоглібська, Шота Руставелі вулиця, Серафимовича вулиця, Волоська вулиця, Будівельників вулиця, 156/2, Борщагівська вулиця, Севастопольська площа, Костянтинiвська, Патріса Лумумби вулиця, Бучми Амвросія вулиця, Микільсько-Слобідська вулиця, Академіка Корольова проспект, Бучмы Амвросия, Мала Житомирська вулиця, Межова вулиця, Примакова вулиця, Фізкультури вулиця, Миру проспект, Басейна вулиця, Соціалістична вулиця, Героев Сталинграда, Русанівський бульвар, Волинська вулиця, Прорізна вулиця, Срібнокільська вулиця, Хмельницька вулиця, Тургенівська вул., Лайоша Гавро вулиця, Багговутівська, Добрий Шлях вулиця, Чороновола вул., Кольцова бульвар, Новопирогівська вулиця, Верховинна, Братиславська вул., Леонтовича вулиця, Ентузіастів вулиця, Хоревий провулок, Заболотного проспект, Ілліча вулиця, Мазепи Івана вулиця, Брусиловська вулиця, Панаса Мирного, Лабораторна вулиця, Почайнинська вулиця, Шота Руставели, Лейпцизька вулиця, Академіка Янгеля вулиця, Саксаганського вулиця, Червонопільська вулиця, Володимира Маяковьского проспект, Науки просп., Маршала Жукова вулиця, Круглоуніверситетська вулиця, Салютна вулиця, Велика Житомирська, Мішуги, Харківське Шосе вулиця, Комбайнерів вулиця, Ревуцкого, Мате-Залки, М.Грушевського вул., Маршала Малиновського вулиця, Ярослава Гашека бульвар, Райдужна вулиця, Лебедєва-Кумача вулиця, Командарма Уборевича вулиця, Межовий провулок, Лепсе Івана бульвар, Теремковська вулиця, Печенізька, Николая Матеюка улица, Механізаторів, Тычины Павла проспект, Леся Курбаса проспект, Златоустівська вулиця, Симона Петлюри вулиця, Велика Окружна вулиця, Полковника Потєхіна вулиця, Прилужна вулиця, Олексіївська вулиця, Красноармейская, Терещенківська вулиця, Богатирська вулиця, Некрасовская улица, Рибальська вулиця, Тростянецька вулиця, Полковника Затевахіна вулиця, Мілютенка, Вербицького архітектора вулиця, Льва Толстого вулиця, Лєскова, Костянтинівська вулиця, Саперне Поле вулиця, Мишуги Олександра вул., Теслярська, Повітрофлотський проспект, Чадаєва Петра вулиця, Урлівська вулиця, ул. Чернобыльская, Контрактова площа, Бассейная, Шумского Юрия, Маршала Якубовського вулиця, Давыдова Алексея бульвар, Кіквідзе вулиця, Воровського вулиця, Дружби Народів бульвар, Глушкова проспект, Братська, Народного Ополчення вулиця, Фроловська вулиця, Миколи Пимоненка вулиця, Дмитрівська вулиця, Набережно-Корчуватська вул., Академіка Каблукова вулиця, Генерала Наумова вулиця, Лісовий проспект, Героїв Дніпра вулиця, пр. Григоренка, Жмеринська вулиця, Боричiв Тiк, Московська вулиця, Володимира Маяковського проспект, Січових Стрільців вул., Марини Раскової вулиця, Чорновола вулиця, Луначарського вулиця, Теодора Драйзера, Зої Гайдай вулиця, Русанівська набережна, Ломоносова вулиця, Березняківска вулиця, Гетьмана Вадима вулиця, Миколи Бажана проспект, Березняківська вулиця, Котельникова, Гетьмана Вадима вулиця (r_street), Столичне шосе, Спаська, Академіка Корольова вулиця, Григоренко Петра проспект, Ревуцкого вулиця, Котовського, Покровська, Докучаєвський пров., Венеція пляж, Шолуденка, Георгія Гонгадзе проспект, Петровського вулиця, Хорива вулиця, Телиги Олени, Хрещатик вулиця, Фроловська, Дніпровська набережна, Пушкінська вулиця, Смоленська вулиця, Івашкевича Ярослава, Драгоманова вулиця, Дегтярівська, Маршала Тимошенко, Академіка Філатова вулиця, Гетьмана Вадима вулиця (s_street), Кипріанова Академіка вулиця, Заслонова Костянтина вулиця, Невська вулиця, Предславинська вулиця, Печерський узвіз, Верхнiй Вал, Жукова, Набережно-Хрещатицька вулиця, Ділова (Димитрова) вулиця, Щорса вулиця, Світлицького вулиця, Велика Житомирська вулиця, Автозаводська вулиця, Немировича-Данченка вулиця, Академіка Білецького вулиця, Героїв Сталінграду проспект, Генерала Потапова вулиця, Лятошинського вулиця, Юрія Гагаріна проспект, Лобачевського пров., Владимира Маяковского проспект, Свободи проспект, Кутузова вулиця, Олександра Пироговського вулиця, Олександра Блока вулиця, Дмитрівська, Павлівська вулиця, Ялтинська вулиця, Речная улица, Довнар-Запольського, Антоновича вулиця, Андрія Малишка, Мечнікова вул., Антоновича, Мишуги Олександра вулиця, Луначарского, Героїв Космосу вулиця, Чудновського вулиця, Миропільська вулиця, Лабораторна, Тампере вул., Воровського вул., Мечникова, Перемоги проспект, Чоколівський бульвар, Пожарського вулиця, Давидова Олексія бульвар, Вышгородская, вул. Лєскова, Yaroslaviv Val, Артема, Олеся Гончара, Щекавицька вулиця, Мельникова, Саратовська вулиця, Сімферопольська вулиця, Щорса провулок, Коцюбинського Михайла вулиця, Солом’янська вулиця, Пчелки, Автозаводська, Відрадний проспект, Миколи Грінченка вулиця, Отто Шмідта, Здолбунівська вулиця, Введенська вулиця, Івана Франка вулиця, Праці бульвар, Лескова, Ярославська вулиця, Григоровича-Барского, Правди проспект, Мечнікова вулиця, Воровского, Петра Вершигори вулиця, Горлівська вулиця, Миколи Закревського вулиця, Михайла Грушевського вулиця, Серафимовича, Уманська вулиця, Роcсийская ул., Ромена Роллана бульвар, Петра Запорожця вулиця, Маршала Тимошенка вулиця, Анни Ахматової вулиця, Соломенская, Академіка Глушкова проспект, Поліський провулок, Шумського Юрія вулиця, Івана Федорова вулиця, Лагерная ул., Тимофія Шамрило, Івана Кудрі вулиця, Академіка Костичева вулиця, Метробудівська вулиця, Петра Григоренко проспект, Марка Вовчка вулиця, Урицького вулиця, Політехнічна вулиця, Волгоградська вулиця, Сєченова вулиця, Декабристів, Бориса Гмирі вулиця, Верховної Ради бульвар, Лісківська вулиця, Данькевича, 21a, Сортувальна, Ніжинська вулиця, Іллінська, Авіаконструктора Антонова вулиця, Симиренко, Кольцевая дорога, Шелковичная ул, Краснозвездный, Берковецька вулиця, Антоновича (Горького) вулиця, Горького вулиця, Івана Лепсе бульвар, Дегтярівська вулиця, Гайдай Зої вулиця, вул. Арсенальна, Сортировочная, Литвиненко-Вольгемут вулиця, Revutskogo, Урожайна вулиця, Арсенальна вулиця, 40-річчя Жовтня проспект, Голосіївська вулиця, Металістів вулиця, Гоголівська, Поліська вулиця, Тарасівська вулиця, Якуба Коласа вулиця, Андріївська, Паньківська вулиця, Дубровицька, Печерська площа, Чапаєва вулиця, Михайла Гришка вулиця, Професора Підвисоцького вулиця, Куренівська, Боженко вулиця, Героїв Севастополя вулиця, Притиско-Никольская, Боженко]
